[
  {
    "id": 5,
    "name": "TutorAI",
    "description": "An AI-powered application that allows users to upload lecture slides or PDFs and generates quizzes based on the content using OpenAI's API. The platform helps students reinforce learning by creating interactive and dynamic quiz questions tailored to their study materials.",
    "short_desc": "AI-driven quiz generator from lecture slides and PDFs.",
    "image": "assets/imgs/tutorai.jpg",
    "languages": ["Python", "TypeScript", "HTML / CSS", "SQL"],
    "skills": ["Natural Language Processing", "Angular", "Flask", "APIs", "RESTapis", "Docker", "AWS"],
    "liveProjectLink": "https://tutorai-b3ud.onrender.com/home"
  },
  {
    "id": 7,
    "name": "Enhancing Road Safety with Thermal Imaging",
    "description": "Excited to share this thermal detection project that I developed for a hackathon hosted by Western Engineering & General Motors! Autonomous vehicles face a critical challenge: detecting obstacles in low-visibility conditions like nighttime, fog, or bad weather. Traditional cameras often struggle, but thermal cameras can capture heat signatures, making them valuable for identifying road users even in complete darkness. We built an embedded road user detection system that processes thermal camera feeds in real time, identifies pedestrians, cyclists, and vehicles with bounding boxes & confidence scores, and runs on a Raspberry Pi 5 for lightweight deployment.",
    "short_desc": "Thermal imaging-based road user detection system for autonomous vehicle safety.",
    "image": "assets/imgs/thermal_final.jpg",
    "languages": ["Python", "Embedded C"],
    "skills": ["Computer Vision", "Embedded Systems", "AI for Safety", "Machine Learning"],
    "githubLink": "https://github.com/victorpostea/thermal_detection",
    "linkedinLink": "https://www.linkedin.com/in/victor-postea-070556298/details/projects/"
  },
  {
    "id": 6,
    "name": "Database Generator",
    "description": "A backend and database system for an in-progress project with the Western Quantum Computing Club. This project generates a Neo4j (GraphQL) database and populates it with clusters of bikeshare stations retrieved from APIs. It optimizes bike redistribution using a quantum computing-based clustering algorithm, ensuring efficient availability across stations.",
    "short_desc": "Generates and populates a Neo4j (GraphQL) database for bikeshare clustering.",
    "image": "assets/imgs/bikeshare.png",
    "languages": ["Python", "NEO4j", "GraphQL"],
    "skills": ["Clustering Algorithms", "Flask", "Data Analytics", "GraphQL", "REST APIs"],
    "githubLink": "https://github.com/victorpostea/bikeshare"
  },    
  {
    "id": 3,
    "name": "Quantum Computing Rebalancing Algorithm",
    "description": "The project involved developing a quantum computing-based algorithm to optimize bike redistribution for Toronto’s Tangerine rideshare program by analyzing station usage trends and determining efficient rebalancing routes to maintain optimal station inventory levels.",
    "short_desc": "Quantum computing-based algorithm to optimize bike redistribution for Toronto's tangerine rideshare.",
    "image": "assets/imgs/quantum-pic.jpg",
    "languages": ["Python", "R"],
    "skills": ["Web Scraping", "Statistical Anaylsis", "Quantum Computing"],
    "awards": ["1st Place at Western University's Quantum Engineering Hackathon - 2024"],
    "githubLink": "https://github.com/victorpostea/Quantum-Hackathon",
    "linkedinLink": "https://www.linkedin.com/in/victor-postea-070556298/details/projects/"
  },
  {
    "id": 2,
    "name": "Automated Syringe Doser",
    "description": "A compact robotic device that helps visually impaired individuals safely and independently dose their medications through tactile buttons and audio cues.",
    "short_desc": "Small robotic device to assist visually and dexterity impaired individuals safely dose syringes.",
    "image": "assets/imgs/syringedose-pic.jpeg",
    "languages": ["Python"],
    "skills": ["Backend Development", "Arduino", "Engineering Design", "Circuits"],
    "awards": ["2nd Place at Western University's Engineering Design Showcase - 2023"],
    "linkedinLink": "https://www.linkedin.com/in/victor-postea-070556298/details/projects/"
  },
  {
    "id": 1,
    "name": "StockAI",
    "description": "A project that web scrapes real-time stock data and utilizes a reinforcement learning algorithm to provide dynamic recommendations on buying or selling portions of your portfolio based on market trends.",
    "short_desc": "Reinforcement learning algorithm to predict stock data and give you portfolio suggestions.",
    "image": "assets/imgs/ai-pic.jpeg",
    "languages": ["Python", "Javascript", "HTML / CSS"],
    "skills": ["Machine Learning", "Angular"]
  },
  {
    "id": 4,
    "name": "Interactive Portfolio Website",
    "description": "A personal portfolio showcasing various projects, skills, and achievements. Built with Angular for a dynamic and responsive user experience, including detailed project pages and links to GitHub, LinkedIn, and live project demos.",
    "short_desc": "My personal portfolio. Showcases projects, skills and achievements.",
    "image": "assets/imgs/portfolio-pic.webp",
    "languages": ["Angular", "TypeScript", "HTML/CSS"],
    "skills": ["Web Development", "Responsive Design", "Frontend Frameworks"],
    "githubLink": "https://github.com/victorpostea/vpostea",
    "liveProjectLink": "https://victorpostea.github.io/vpostea"
  }
]